# 変数とprintの使い方

# 変数aに1を代入
a = 1

#ここに変数bに10を代入してみよう
b = 10

#pythonでは、変数の宣言に「var」みたいなキーワードは使わないことに気付いたかな？
#テキストP16の重要の内容をヒントに、以下の空白に当てはまる言葉を埋めよう。

#Pythonでは、初めて使う変数名の変数に値を代入すると、その名前の変y数が自動的に用意される。

#↑これは今日中に覚えてしまおう。

#ここに変数testに文字列「これはテストです」を代入してみよう
test = "これはテストです"

#ここに変数piに3.14を代入してみよう
pi = 3.14

# 画面への出力はprintを使う
print('やっほー')
print(a)

#変数testに何か文字を代入し、その内容をprintで表示してみよう
test = 56
print(test)
deta = 'this is a \'pen\''
print(deta)


# 変数のデータ型を確認する場合はtypeを使う。
# 変数aのデータ型を調べる→type(a)

# 変数aのデータ型を画面に表示する
print(type(a))
print(type(deta))

#変数b,data1,data2,data3,test,piそれぞれのデータ型を画面に表示しよう